#!/usr/bin/env python
# -*- coding: utf-8 -*-

# подсказка: тут надо погуглить методы pop, index, extend, insert
# пример гугл запроса: python pop list
# есть список животных в зоопарке

zoo = ['lion', 'kangaroo', 'elephant', 'monkey', ]


# TODO посадите медведя (bear) между львом и кенгуру
#  и выведите список на консоль


# TODO добавьте птиц из списка birds в последние клетки зоопарка
#  и выведите список на консоль


# TODO уберите слона
#  и выведите список на консоль


# TODO выведите на консоль в какой клетке сидит лев (lion) и жаворонок (lark).
#  Номера при выводе должны быть понятны простому человеку, не программисту.
