#!/usr/bin/env python
# -*- coding: utf-8 -*-

# в саду сорвали цветы
garden = ('ромашка', 'роза', 'одуванчик', 'ромашка', 'гладиолус', 'подсолнух', 'роза', )

# на лугу сорвали цветы
meadow = ('клевер', 'одуванчик', 'ромашка', 'клевер', 'мак', 'одуванчик', 'ромашка', )


# TODO создайте множество цветов, произрастающих в саду и на лугу
#подсказка - гуглите как делать множества в питоне

# garden_set =
# meadow_set =

# тут нужн погуглить операции для работы со множествами.
# но вообще они очевидны:
# | объединение
# & пересечение
# - вычитание

# TODO выведите на консоль все виды цветов


# TODO выведите на консоль те, которые растут и там и там


# TODO выведите на консоль те, которые растут в саду, но не растут на лугу


# TODO выведите на консоль те, которые растут на лугу, но не растут в саду
